Repository: KaiqiangLiu/stampython
Catalog: stampy/locale/*/LC_MESSAGES/stampy.po
Languages: es

source: Language changed to %s
es: Idioma cambiado a %s

source: Plugin added: %s
es: Complemento añadido: %s

source: Plugin disabled: %s
es: Complemento deshabilitado: %s

source: Processing plugin initialization: %s
es: Procesando inicialización del complemento: %s

source: Plugin %s is triggered by %s
es: Plugin %s se activa mediante %s

source: Stampy is a script for controlling Karma via Telegram.org bot api
es: Stampy es un programa para control de karma mediante el api de robots de Telegram.org

source: API token for bot access to messages
es: Clave para el API de telegram para acceder a los mensajes

source: database file for storing karma
es: fichero de base de datos para almacenar el karma

source: Set verbosity level for messages while running/logging
es: Establecer nivel de detalle de los mensajes durante la ejecución

source: Define URL for accessing bot API
es: Definir la URL para acceder al API de robots

source: Define owner username
es: Definir nombre de usuario para propietario

source: Run as daemon
es: Ejecutar como demonio

source: Using alembic to upgrade/create database to expected revision
es: Utilizando alembic para actualizar/crear la base de datos con la revisión esperada

source: Error accessing database, creating...
es: Error accediendo a la base de datos, creándola...

source: Error # %s on SQL execution: %s
es: Error # %s en la ejecución SQL: %s

source: ERROR (%s) sending message: Code: %s : Text: %s
es: ERROR (%s) enviando el mensaje: Código: %s : Texto: %s

source: PERM ERROR sending message: Code: %s : Text: %s
es: ERROR PERMANENTE al enviar el mensaje: Código: %s : Texto: %s

source: Sending message: Code: %s : Text: %s
es: Enviando mensaje: Código: %s : Texto: %s

source: Getting updates and returning: %s
es: Obteniendo actualizaciones y devolviendo: %s

source: Getting bot details and returning: %s
es: Obteniendo Detalles del bot y devolviendo: %s

source: Clearing messages at %s
es: Borrando mensajes en %s

source: Sending sticker: %s
es: Enviando pegatina: %s

source: Sending image: %s
es: Enviando imagen: %s

source: Failure sending image: %s
es: Fallo enviando imagen: %s

source: Failure downloading image: %s
es: Fallo descargando imagen: %s

source: TEXT: %s : %s : %s
es: TEXTO: %s : %s : %s

source: Processing plugin: %s
es: Procesando complemento: %s

source: New triggers for %s: %s
es: Nuevos disparadores para %s: %s

source: Last processed message at: %s
es: Último mensaje procesado en: %s

source: Last processed update_id : %s
es: Última actualización procesada: %s

source: Number of messages in this batch: %s
es: Número de mensajes en este lote: %s

source: Final deduplicated list: %s
es: Lista final deduplicada: %s

source: We're admin of private chats
es: Somos admin de chats privados

source: We're not owner of public chats
es: No somos propietarios de chats publicos

source: We're admin of public chat
es: Somos administrador de chat público

source: We're admin because no admin listed on public chat
es: Somos administradores porque no hay administrador definido en el chat público

source: Logging level set to %s
es: Nivel de registro establecido a %s

source: Started execution
es: Ejecución iniciada

source: Token required for operation, please check https://core.telegram.org/bots
es: Es necesaria una clave/token para operar, por favor, revise https://core.telegram.org/bots

source: Plug triggers reported: %s
es: Complementos devueltos: %s

source: Running in daemon mode
es: Ejecutando en modo demonio

source: Running in one-shoot mode
es: Ejecución única

source: Stopped execution
es: Ejecución detenida

source: Use `/admin unlink` to remove channel linking
es: Use `/admin unlink` para eliminar un enlace de canal

source: Use `/admin link master` to generate and store linking token to be used on slaves
es: Use `/admin link master <token> para generar y almacenar un token de enlazado para usarse en esclavos

source: Use `/admin link slave <token> to use provided token to link against master channel
es: Use `/admin link slave <token> para usar el token proporcionado al enlazar contra el canal maestro master channel

source: Use `/admin link show to list linked channel
es: Use `/admin linik show` para listar los canales enlazados

source: Command: %s by %s
es: Comando: %s por %s

source: Generated token %s for channel %s
es: Generado el token %s para el canal %s

source: Token for linking against this channel has been generated as %s
es: Token para enlazar a este canal generado como %s

source: Already generated token %s for channel %s
es: Token ya generado %s para el canal %s

source: A token for linking against this channel already existed as %s
es: Un token para enlazar contra este canal ya existe como %s

source: Channel has also been enabled as running in isolated mode, use ```/gconfig delete isolated``` to revert back to global karma
es: Este canal ha sido configurado para ejecutarse en modo aislado, utilice ```/gconfig delete isolated``` para volver a utilizar el karma global

source: This channel is a slave for another one, cannot generate token
es: Este canal es esclavo del de otro, no puedo generar token

source: chanenslave: %s, master-id: %s, master-token:%s
es: chanenslave: %s, id maestro: %s, clave: %s

source: Channel *%s* with name *%s* has been linked as *SLAVE*
es: Canal *%s* con nombre *%s* ha sido enlazado como *ESCLAVO*

source: This channel has been set as *SLAVE* from *MASTER* channel *%s*
es: Este canal ha sido establecido como *ESCLAVO* del canal *MAESTRO* *%s*

source: Channel *%s* with name *%s* has been unlinked as *SLAVE*
es: El canal *%s* con nombre *%s* ha sido desenlazado como *ESCLAVO*

source: This channel has been unliked as *SLAVE* from *MASTER* channel *%s*
es: Este canal ha sido desenlazado como *ESCLAVO* del canal *MAESTRO* *%s*

source: This channel %s is slave of channel %s
es: Este canal %s es esclavo del canal %s

source: Defined slaves:
es: Esclavos definidos:

source: Processing plugin: Code: %s
es: Procesando el complemento: Código: %s

source: Use `/alias <key>=<value>` to assign an alias for karma
es: Use `/alias <clave>=<valor>` para asignar un alias para el karma

source: Use `/alias list` to list aliases
es: Use `/alias list` para listar los alias

source: Use `/alias delete <key>` to remove an alias
es: Use `/alias delete <clave>` para eliminar un alias

source: Command: %s by Owner: %s
es: Comando: %s por propietario: %s

source: Deleting alias for `%s`
es: Borrando alias para `%s`

source: Setting alias for `%s` to `%s`
es: Estableciendo alias de `%s` a `%s`

source: %s has an alias %s
es: %s tiene un alias %s

source: Defined aliases:
es: Alias definidos:

source: Returning aliases %s for word %s for gid %s
es: Devolviendo alias %s para la palabra %s para gid %s

source: createalias: circular reference %s=%s for gid %s
es: createalias: referencia circular %s=%s para gid %s

source: Use `/autok <key>=<value>` to autokarma <value> every time key is in the conversation. Multiple values for same <key> can be added
es: Use `/autok <clave>=<valor>` para incrementar el karma de <valor> cada vez que <key> aparezca en una conversación. Múltiples valores para la misma <clave> pueden ser definidos

source: Use `/autok delete <key>=<value>` to delete autokarma <value> for <key>
es: Use `/autok delete <clave>=<valor>` para eliminar el disparador de <valor> para <clave>

source: Use `/autok list` to list autokarma <key> <value> pairs
es: Use `/autok list` para mostrar las parejas de claves/valor de autokarma

source: Deleting autokarma pair for `%s - %s`
es: Borrando pareja de auto karma para `%s - %s`

source: Setting autokarma for `%s` triggers `%s++`
es: Estableciendo autokarma para `%s` que desencadena `%s++`

source: createautok: autok pair %s - %s for gid %s already exists
es: createautok: la pareja de autokarma %s - %s para el groupo %s ya existe

source: for word %s for gid %s
es: para la palabra %s para id %s

source: Defined autokarma triggers %s:
es: Disparadores de autokarma %s:

source: %s has no trigger autokarma
es: %s no tiene un disparador de autokarma

source: Returning autokarma %s for word %s
es: Devolviendo autokarma %s para la palabra %s

source: Autokarma words %s encountered for processing
es: Encontradas palabras autokarma %s para procesado

source: Use `/quit` to exit bot execution
es: Utilice `/quit´ para salir del modo demonio

source: Use `/comic list` to list comics defined
es: Use `/comic list` para mostrar los comics definidos

source: Use `/comic all` to show all actual comics
es: Use `/comic all` para mostrar todos los comics conocidos

source: Use `/comic trigger` to send comics to chats defined
es: Use `/commic trigger` para forzar el envío de las viñetas

source: Defined comic strips:
es: Comics definidos:

source: Returning comics
es: Devolviendo comics

source: Comic: %s, last: %s, now: %s, url: %s
es: Comic: %s, último: %s, actual: %s, url: %s

source: Updating last checked as per %s
es: Actualizando última comprobación a %s

source: # of Comics for today: %s
es: Número de viñetas hoy: %s

source: Use `/config show` to get a list of defined config settings
es: Use `/config show` para obtener el listado de opciones configuradas

source: Use `/config set <key>=<value>` to define a value for key
es: Use `/config set <clave>=<valor>` para definir un valor para una clave

source: Use `/config delete <key>` to delete key
es: Use `/config delete <clave>` para eliminar un valor

source: /gconfig acts on 'effective chat' while /lconfig on 'local chat' (for linked))
es: /gconfig actúa en el 'chat efectivo', mientra que /lconfig actúa en el 'chat local' (para los enlazados)

source: Use `/[g|l]config show` to get a list of defined group config settings
es: Use `/[g|l]config show` para obtener el listado de opciones configuradas

source: Use `/[g|l]gconfig set <key>=<value>` to define a value for key
es: Use `/[g|l]config set <clave>=<valor>` para definir un valor para una clave

source: Use `/[g|l]gconfig delete <key>` to delete key
es: Use `/[g|l]config delete <clave>` para eliminar un valor

source: Deleting config for `%s`
es: Borrando configuración para `%s`

source: Key *%s* not allowed to be removed
es: La clave *%s* no tiene autorización para eliminarla

source: Setting config for `%s` to `%s`
es: Estableciendo configuración para `%s` a `%s`

source: Key *%s* not allowed to be set
es: La clave *%s* no está autorizada para ser definida

source: %s has a value of %s for id %s
es: %s tiene un valor de %s para el id %s

source: Defined configurations for gid %s:
es: Configuraciones definidas para gid %s:

source: Returning config %s for key %s for id %s
es: Devolviendo configuración %s para %s para id %s

source: setconfig: %s=%s for id %s
es: setconfig %s=%s para id %s

source: rmconfig: %s for id %s
es: rmconfig %s para id %s

source: Use `/espp <amount>` to get estimated ESPP earnings
es: Use `/espp <importe>` para obtener una estimación de ganancias de ESPP con dicha cuota mensual

source: USD/%s rate
es: Tasa de cambio USD/%s

source: Initial quote: %s USD
es: Precio inicial: %s USD

source: Actual quote: %s USD
es: Precio actual: %s USD

source: Buy price: %s USD
es: Precio de compra: %s USD

source: Earning per unit: %s USD
es: Ganancia por acción: %s USD

source: Estimated stocks: %s
es: Acciones estimadas: %s

source: Estimated earning: %s %s
es: Ganancias estimadas: %s %s

source: Total amount deposited on sell: %s %s
es: Importe total transferido a la venta: %s %s

source: Estimated A.E.R. vs investment: %s %%
es: Tasa de interés vs inversión: %s %%

source: espp setting not defined, please use /gconfig set espp=<value>
es: espp no está definida, utilice /gconfig set espp=<valor>

source: Processing forward commands
es: Procesando comandos de reenvío

source: Use `/forward <source>=<target>` to assign a forwarder
es: Use `/forward <origen>=<destino>` para establecer un reenvío

source: Use `/forward list` to list forwards defined
es: Use `/forward list` para mostrar los reenvíos definidos

source: Use `/forward delete <source>=<target>` to remove a forwarding
es: Use `/forward delete <origen>=<destino>` para eliminar un reenvío

source: forwarding message: Code: %s : Text: %s
es: reenviando mensaje: Código: %s : Texto: %s

source: ERROR (%s) forwarding message: Code: %s : Text: %s
es: ERROR (%s) al reenviar el mensaje: Código: %s : Texto: %s

source: PERM ERROR forwarding message: Code: %s : Text: %s
es: ERROR PERMANENTE al reenviar el mensaje: Código: %s : Texto: %s

source: Forward plugin not enabled, skipping
es: Complemento de reenvío no habilitado, saltando

source: Deleting forward for `%s -> %s`
es: Borrando reenvio de "%s -> %s`

source: Setting forward for `%s` to `%s`
es: Estableciendo reenvío de `%s` a `%s`

source: %s has a forward %s
es: %s tiene una redirección %s

source: Defined forwards:
es: Reenvíos definidos:

source: createforward: circular reference %s=%s
es: createforward: referencia circular %s=%s

source: Use `/help` to display commands help
es: Use `/help` para mostrar la ayuda de los comandos

source: Read about announcements at https://t.me/redkennews
es: Lea más información y anuncios en https://t.me/redkennews

source: Message sent privately, open a chat with @%s and say hi to receive private messages or read https://github.com/iranzo/stampython/blob/master/README.md
es: Mensaje enviado de forma privada, abra un chat con @%s y diga hola para recibir mensajes privados o lea https://github.com/iranzo/stampython/blob/master/README.md

source: Command: %s
es: Comando: %s

source: Use `/hilight add <word>` to add word to your hilight list so messages in channels you're member will be forwarded privately to you (need to start prior conversation with bot)
es: Use `/hilight add <palabra>` para añadir la palabra a su lista de hilight, para que los mensajes de los canales en los que sea miembro se redirijan de forma privada (debe previamente haber iniciado conversación con el bot)

source: Use `/hilight delete <word>` to delete word from your hilight list
es: Use `/hilight delete <palabra>` para borrar una palabra de su lista de hilight

source: Use `/hilight list` to list hilights enabled for your user
es: Use `/hilight list` para listar los hilight habilitados para su usuario

source: Command: %s by user: %s
es: Comando: %s por usuario: %s

source: Deleting hilight for `%s`
es: Borrando hilight para `%s`

source: Adding hilight for `%s`
es: Añadiendo hilight para `%s`

source: createhilight: word %s for uid %s already exists
es: createhilight: palabra %s para el usuario %s ya existe

source: for word %s for uid %s
es: para la palabra %s para uid %s

source: Defined hilight triggers %s:
es: Disparadores de hilight %s:

source: %s has no trigger hilight
es: %s no tiene un disparador de hilight

source: Returning hilight %s for word %s
es: Devolviendo hilight %s para la palabra %s

source: User %s is member of group %s
es: Usuario %s es miembro del grupo %s

source: Word %s is in text and forwarding for user
es: Palabra %s en el texto, y en reenvio para el usuario

source: User %s NOT member of group %s (%s)
es: El usuario %s no es miembro del grupo %s (%s)

source: Message sent to chat: %s
es: Mensaje enviado al chat: %s

source: User %s has blocked bot direct communication, deleting hilights
es: El usuario %s ha bloqueado la comunicación directa, borrando hilights

source: Use `/info` to return information about the current message
es: Use `/info` para devolver información acerca del mensaje actual

source: This is update *%s*
es: Esta es la actualización *%s*

source: with message id *%s*.
es: con id de mensaje *%s*.

source: This has been sent on chat *%s*, named *%s* on *%s*
es: Este mensaje ha sido enviado en el chat *%s*, llamado *%s* el *%s*

source: This message was sent by user id *%s*, with given name *%s*, long name *%s* and username *%s*
es: Este mensaje fue enviado por el usuario *%s*, con nombre *%s*, nombre largo *%s* y usuario *%s*

source: Returning %s
es: Devolviendo %s

source: Use `word++` or `word--` to increment or decrement karma, a new message will be sent providing the new total
es: Use `palabra++` o `palabra--` para incrementar o reducir el karma, se enviará un nuevo mensaje informando del nuevo acumulado

source: Reply to a message with `++`, `--` to give user karma to telegram alias or `==` to repeat karma to the same words
es: Responda a un mensaje con `++`, `--` para darle karma al usuario de telegram o `==` para dárselo a las mismas palabras

source: Use `rank <word>` or `rank` to get value for actual word or top 10 rankings
es: Use `rank <palabra>` o `rank` para obtener el karma de la palabra indicada o las 10 con más puntos

source: Use `srank <word>` to search for similar words already ranked
es: Use `srank <palabra>` para buscar por palabras similares con karma

source: Use `skarma <word>=<value>` to establish karma of a word
es: Use `skarma palabra=valor` para establecer el karma de una palabra

source: Use `skarma purge` to clear old karma
es: Use `skarma purge` para borrar el karma obsoleto

source: Setting karma for `%s` to `%s`
es: Estableciendo karma de `%s` a `%s`

source: `%s` has `%s` karma points.
es: `%s` tiene `%s` puntos de karma.

source: Global rankings:
es: Clasificaciones globales:

source: Returning karma %s for word %s
es: Devolviendo karma %s para la palabra %s

source: Returning srank for word: %s
es: Devolviendo srank para la palabra: %s

source: Putting karma of %s to %s
es: Poniendo karma de %s a %s

source: Getting karma for %s: %s
es: Obteniendo karma de %s: %s

source: Sticker for %s karma points
es: Pegatina por %s puntos de karma

source: Text to process: %s
es: Texto a procesar: %s

source: Text has karma operators
es: El texto tiene operadores de karma

source: Processing word %s sent by id %s with username %s (%s %s)
es: Procesando palabra %s enviada por id %s con nombre de usuario %s (%s %s)

source: %s Found in %s at %s with id %s (%s), sent by id %s named %s (%s %s)
es: %s Encontrado en %s a las %s con id %s (%s), enviada por id %s llamado %s (%s %s)

source: `%s` now has `%s` karma points.
es: `%s` tiene ahora `%s` puntos de karma.

source: `%s` now has no Karma and has been garbage collected.
es: `%s` ahora no tiene Karma y ha sido eliminado.

source: Processing words for cleanup: %s
es: Procesando palabras para limpieza: %s

source: Word %s with %s inactivity days is going to be purged
es: La palabra %s con %s días de inactividad va a ser eliminada

source: Use `/kick <username or id>` to kick user from chat
es: Use `/kick <usuario o id>` para expulsar a un usuario del chat

source: Use `/kickban <username or id>` to kick user from chat and ban to forbid new entry
es: Use `/kickban <usuario o id>` para expulsar a un usuario del chat e impedirle la entrada de nuevo

source: Use `/unban <user ID>`
es: Use `/unban <usuario o id>` para aceptar al usuario de chat de nuevo

source: Owner kick/ban/unban: %s by %s
es: Expulsar/prohibir/aceptar por propietario: %s por %s

source: Not unique user found for command, retry
es: No se encontró a un usuario único, reintente

source: User %s kicked out of chat %s
es: Usuario %s expulsado del chat %s

source: Error kicking user %s from chat %s: %s
es: Error expulsando al usuario %s del chat %s: %s

source: User %s kicked and banned out of chat %s
es: Usuario %s expulsado y bloqueado en el chat %s

source: Error kick+ban user %s from chat %s: %s
es: Error expulsando y bloqueando al usuario %s del chat %s: %s

source: User %s unbanned out of chat %s
es: Usuario %s de nuevo permitido en el chat %s

source: Error unbanning user %s from chat %s: %s
es: Error al aceptar al usuario %s del chat %s: %s

source: User %s kicked and banned from %s
es: Usuario %s expulsado y bloqueado del grupo %s

source: Error when kicking user: %s
es: Error al expulsar al usuario: %s

source: User %s unbaned from %s
es: Usuario %s de nuevo aceptado en grupo %s

source: Use `/quote add <id> <text>` to add a quote for that username
es: Use `/quote add <id> <texto>` para añadir una cita para dicho usuario

source: Use `/quote <id>` to get a random quote from that username
es: Use `/quote <id>` para obtener una cita aleatoria de dicho nombre de usuario

source: Use `/quote del <quoteid>` to remove a quote
es: Use `/quote del <id de cita>` para eliminar una cita

source: Quote `%s` added
es: Cita `%s` añadida

source: Deleting quote id `%s`
es: Borrando cita con id `%s`

source: No quote recorded for `%s`
es: No hay cita almacenada para `%s`

source: No quote found
es: No se encontraron citas

source: createquote: %s=%s on %s for group %s
es: createquote: %s=%s en %s para el grupo %s

source: Someone with id %s left chat %s, cleaning up
es: Alguien con el id %s abandonó el chat %s, limpiando

source: Bot has left chat %s, cleaning up
es: El bot ha salido del canal %s, limpiando

source: Use `@all` to ping all users in a channel as long as they have username defined in Telegram
es: Use `@all` para mencionar a todos los usuarios en un canal que tengan un nombre de usuario definido en Telegram

source: Use `/stats show <user|chat|search>` to get stats on last usage
es: Use `/stats show <usuario|chat|search>` para obtener estadísticas de uso

source: Use `/getout <chatid|here>` to have bot leave that chat or current one
es: Use `/getout <chatid|here>` para hacer que el bot salga del chat especificado o el actual

source: Owner Stat: %s by %s
es: Estadísticas de propietario: %s por %s

source: Owner getout: %s by %s
es: Expulsión del propietario: %s por %s

source: Defined stats:
es: Estadísticas definidas:

source: Returning stats %s
es: Devolviendo estadísticas %s

source: values: type:%s, id:%s, name:%s, date:%s, count:%s, memberid: %s
es: valores: tipo: %s, id:%s, nombre:%s, fecha:%s, numero:%s, memberid: %s

source: ERROR on updatestats
es: ERROR al ejecutar updatestats

source: ERROR on remove_from_memberid
es: ERROR en remove_from_memberid

source: Chat id %s users %s
es: Chat id %s usuarios %s

source: Chat id %s left
es: Chat id %s abandonado

source: Processing chat_ids for cleanup: %s
es: Procesando chat_ids para limpieza: %s

source: CHAT ID %s with name %s with %s inactivity days is going to be purged
es: El chat %s con nombre %s y %s días de inactividad va a ser eliminado

source: Due to inactivity of more than %s days, this bot will exit the channel, please re-add in the future if needed
es: Debido a inactividad de más de %s días, este bot saldrá del canal, por favor, reañádalo en el futuro si es necesario

source: The removed channel (%s) was master for others, electing new master: %s
es: El canal eliminado (%s) era MAESTRO para otros, escogiendo a nuevo maestro: %s

source: LINE for user %s and memberid: %s will be deleted
es: LINEA para usuario %s con memberid: %s será eliminada

source: Migrating chat id: %s to %s
es: Migrando chat id %s a %s

source: Processing userids for cleanup: %s
es: Procesando userids para limpieza: %s

source: USER ID %s with name %s with %s inactivity days is going to be purged
es: El usuario %s con nombre %s y con %s días de inactividad va a ser eliminado

source: values: type:%s, id:%s, name:%s, date:%s, count:%s, memberid:%s
es: valores: tipo: %s, id:%s, nombre:%s, fecha:%s, numero:%s, memberid: %s

source: @All invoked
es: @All invocado

source: %s wanted to ping you:
es: %s quiso mencionarle:

source: Pinging chat %s: %s on %s
es: Mencionando chat %s: %s en %s

source: Found users with id(%s)/chat(%s): %s
es: Encontrado usuarios con id(%s)/chat(%s): %s

source: Use `stock <ticker>` to get stock trading price
es: Use `stock <valor>` para obtener la cotización del valor

source: USD/%s rate
es: Tasa de cambio USD/%s

source: Use `/sudo gid=<gid>` to assign group to work on
es: Use `/sudo gid=<gid>` para asignar grupo con el que se trabajará
