Repository: KaiqiangLiu/stampython
Catalog: stampy/locale/*/LC_MESSAGES/stampy.po
Languages: es

source: Use `/sudo command` to execute command as if chat id were the one defined
es: Use `/sudo comando` para ejecutar `comando` como si el gid fuera el indicado previamente

source: Setting gid for sudo to `%s`
es: Estableciendo gid para sudo a `%s`

source: As admin or owner define 'welcome' to the greeting text sent to new chat members. You can use $username to put long name in the text
es: Como administrador o propietario, defina 'welcome' con el texto de bienvenida a enviar a nuevos miembros del chat. Puede usar $username para reemplazarlo por el nombre del usuario en el texto

source: New user in chat, sending greetings: %s
es: Nuevo usuario en el chat, enviando saludos: %s
